{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "1c54d2e9",
   "metadata": {},
   "source": [
    "Вложенные циклы for:\n",
    "\n",
    "\n",
    "\n",
    "1. Рисование прямоугольника из звездочек:\n",
    "\n",
    "Задача: Напишите программу, которая рисует прямоугольник из звездочек (*). Пользователь вводит высоту и ширину прямоугольника (по очереди примите два значения от пользователя, не одновременно).\n",
    "\n",
    "Инструменты: Используйте внешний цикл for для перебора строк и внутренний цикл for для перебора столбцов в каждой строке. Используйте print\n",
    "\n",
    "Вывод:\n",
    "\n",
    " - Предположим, пользователь вводит высоту 3 и ширину 5. Тогда вывод программы будет следующим:\n",
    "\n",
    "     *****\n",
    "\n",
    "     *****\n",
    "\n",
    "     *****\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "id": "62da8356",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "высота:3\n",
      "ширина:5\n",
      "*****\n",
      "\n",
      "*****\n",
      "\n",
      "*****\n",
      "\n"
     ]
    }
   ],
   "source": [
    "number1=int(input(\"высота:\"))\n",
    "number2=int(input(\"ширина:\"))\n",
    "for i in range(number1):\n",
    "    for j in range(number2):\n",
    "        print(\"*\", end='')\n",
    "    print('\\n')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "75a3391c",
   "metadata": {},
   "source": [
    "Задача: Напишите программу, которая для чисел от 1 до N (N задается пользователем) выводит их степени от 1 до M (M также задается пользователем).\n",
    "\n",
    "Инструменты: Используйте один цикл for для перебора чисел от 1 до N и вложенный цикл for для возведения каждого числа в степени от 1 до M.\n",
    "\n",
    "Вывод:\n",
    "\n",
    "- Если пользователь задает N = 3 и M = 4, то вывод будет следующим (выводятся степени каждого числа от 1 до 4):\n",
    "\n",
    "     1^1 = 1, 1^2 = 1, 1^3 = 1, 1^4 = 1\n",
    "\n",
    "\n",
    "\n",
    "     2^1 = 2, 2^2 = 4, 2^3 = 8, 2^4 = 16\n",
    "\n",
    "\n",
    "\n",
    "     3^1 = 3, 3^2 = 9, 3^3 = 27, 3^4 = 81"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "id": "41b04dad",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "N=3\n",
      "M=4\n",
      "1 ^ 1 = 1 , 1 ^ 2 = 1 , 1 ^ 3 = 1 , 1 ^ 4 = 1 , \n",
      "\n",
      "2 ^ 1 = 2 , 2 ^ 2 = 4 , 2 ^ 3 = 8 , 2 ^ 4 = 16 , \n",
      "\n",
      "3 ^ 1 = 3 , 3 ^ 2 = 9 , 3 ^ 3 = 27 , 3 ^ 4 = 81 , \n",
      "\n"
     ]
    }
   ],
   "source": [
    "N=int(input(\"N=\"))\n",
    "M=int(input(\"M=\"))\n",
    "for i in range(1,N+1):\n",
    "    for j in range(1,M+1):\n",
    "        print(i,'^',j,'=',i**j,', ', end='')\n",
    "    print('\\n')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a0973b4b",
   "metadata": {},
   "source": [
    "Циклы while:\n",
    "\n",
    "\n",
    "\n",
    "1. Создание простого счетчика времени:\n",
    "\n",
    "Задача: Напишите программу, которая ведет обратный отсчет от заданного пользователем времени в секундах до нуля.\n",
    "\n",
    "Инструменты: Используйте цикл while для уменьшения счетчика каждую секунду и вывода оставшегося времени. Программа должна остановиться, когда счетчик достигнет нуля.\n",
    "\n",
    "Вывод:\n",
    "\n",
    "- Если пользователь задает время 5 секунд, то вывод будет выглядеть так:\n",
    "\n",
    "     5\n",
    "\n",
    "\n",
    "\n",
    "     4\n",
    "\n",
    "\n",
    "\n",
    "     3\n",
    "\n",
    "\n",
    "\n",
    "     2\n",
    "\n",
    "\n",
    "\n",
    "     1\n",
    "\n",
    "\n",
    "\n",
    "     Время истекло!"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "211bc17e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "введите число:5\n",
      "5\n",
      "4\n",
      "3\n",
      "2\n",
      "1\n",
      "Время истекло!\n"
     ]
    }
   ],
   "source": [
    "number=int(input(\"введите число:\"))\n",
    "count=1\n",
    "while number>=count:\n",
    "    print(number)\n",
    "    number-=1\n",
    "else:\n",
    "    print(\"Время истекло!\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a8abdee5",
   "metadata": {},
   "source": [
    "2.Программа угадывания числа:\n",
    "\n",
    "Задача: Напишите программу, где компьютер загадывает число от 1 до 100, а пользователь пытается его угадать. После каждой попытки программа должна сообщать, больше или меньше загаданное число, чем введенное пользователем. Процесс продолжается до тех пор, пока число не будет угадано.\n",
    "\n",
    "Инструменты: Используйте цикл while для повторения действий, пока пользователь не угадает число.\n",
    "\n",
    "Вывод:   \n",
    "\n",
    "- Представим, что компьютер загадал число 42, а пользователь вводит следующие числа: 50, 30, 45, 42. Тогда вывод будет таким:\n",
    "\n",
    "     Ваше число: 50\n",
    "\n",
    "     Загаданное число меньше!\n",
    "\n",
    "     Ваше число: 30\n",
    "\n",
    "     Загаданное число больше!\n",
    "\n",
    "     Ваше число: 45\n",
    "\n",
    "     Загаданное число меньше!\n",
    "\n",
    "     Ваше число: 42\n",
    "\n",
    "     Вы угадали число!"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c0e2f990",
   "metadata": {},
   "outputs": [],
   "source": [
    "from random import randint\n",
    "N=randint(1,100)\n",
    "while K!=N:\n",
    "    K=int(input(\"Ваше число:\"))\n",
    "    if K<N:\n",
    "        print(\"Загаданное число меньше!\")\n",
    "    elif K>N:\n",
    "        print(\"Загаданное число больше!\")\n",
    "    else:\n",
    "        print(\"Вы угадали число!\")\n",
    "print(K)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "8039a779",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
